PLITA_PRICES = {
    "1.2 м": {
        "1.9": 214988, "2.0": 214988, "2.1": 214988, "2.2": 214988, "2.3": 214988,
        "2.4": 214988, "2.5": 214988, "2.6": 214988, "2.7": 214988, "2.8": 214988,
        "2.9": 214988, "3.0": 214988, "3.1": 214988, "3.2": 214988, "3.3": 214988,
        "3.4": 214988, "3.5": 214988, "3.6": 214988, "3.7": 214988, "3.8": 214988,
        "3.9": 214988, "4.0": 214988, "4.1": 214988, "4.2": 214988, "4.3": 214988,
        "4.4": 214988, "4.5": 214988, "4.6": 214988, "4.7": 214988,
        "4.8": 237038, "4.9": 237038, "5.0": 237038, "5.1": 237038, "5.2": 237038,
        "5.3": 237038, "5.4": 237038, "5.5": 237038,
        "5.6": 240345, "5.7": 240345, "5.8": 240345, "5.9": 240345,
        "6.0": 270113, "6.1": 270113, "6.2": 270113, "6.3": 270113, "6.4": 270113,
        "6.5": 270113, "6.6": 270113, "6.7": 270113, "6.8": 270113, "6.9": 270113,
        "7.0": 270113,
        "7.1": 281138, "7.2": 281138, "7.3": 281138, "7.4": 281138,
        "7.5": 308700, "7.6": 308700, "7.7": 308700, "7.8": 308700, "7.9": 308700,
        "8.0": 308700, "8.1": 308700, "8.2": 308700, "8.3": 308700, "8.4": 308700,
        "8.5": 396900, "8.6": 396900, "8.7": 396900, "8.8": 396900, "8.9": 396900,
        "9.0": 418950
    },
    "1.0 м": {
        "1.9": 187425, "2.0": 187425, "2.1": 187425, "2.2": 187425, "2.3": 187425,
        "2.4": 187425, "2.5": 187425, "2.6": 187425, "2.7": 187425, "2.8": 187425,
        "2.9": 187425, "3.0": 187425, "3.1": 187425, "3.2": 187425, "3.3": 187425,
        "3.4": 187425, "3.5": 187425, "3.6": 187425, "3.7": 187425,
        "3.8": 198450, "3.9": 198450, "4.0": 198450, "4.1": 198450,
        "4.2": 203963, "4.3": 203963, "4.4": 203963, "4.5": 203963, "4.6": 203963, "4.7": 203963,
        "4.8": 217193, "4.9": 217193, "5.0": 217193, "5.1": 217193, "5.2": 217193,
        "5.3": 217193, "5.4": 217193, "5.5": 217193, "5.6": 217193, "5.7": 217193,
        "5.8": 217193, "5.9": 217193,
        "6.0": 226013, "6.1": 226013, "6.2": 226013,
        "6.3": 220500, "6.4": 220500, "6.5": 220500,
        "6.6": 237038, "6.7": 237038, "6.8": 237038, "6.9": 237038, "7.0": 237038, "7.1": 237038,
        "7.2": 286650, "7.3": 286650, "7.4": 286650, "7.5": 286650, "7.6": 286650, "7.7": 286650, "7.8": 286650,
        "7.9": 336263, "8.0": 336263, "8.1": 336263, "8.2": 336263, "8.3": 336263, "8.4": 336263,
        "8.5": 407925, "8.6": 407925, "8.7": 407925, "8.8": 407925, "8.9": 407925,
        "9.0": 407925
    }
}

MESSAGES = {
    "ask_name": {
        "ru": "👤 <b>Введите ваше имя:</b>",
        "uz": "👤 <b>Ismingizni kiriting:</b>"
    },
    "ask_phone": {
        "ru": "📱 <b>Введите ваш номер телефона:</b>\n<i>Например: +998901234567</i>",
        "uz": "📱 <b>Telefon raqamingizni kiriting:</b>\n<i>Masalan: +998901234567</i>"
    },
    "ask_nasos": {
        "ru": "🚜 <b>Вам нужен бетононасос?</b>",
        "uz": "🚜 <b>Sizga betononasos kerakmi?</b>"
    },
    "ask_date": {
        "ru": "📅 <b>Дата отгрузки (ДД.ММ.ГГГГ):</b>\n<i>Пример: 10.03.2026</i>",
        "uz": "📅 <b>Yuklash sanasi (KK.OO.YYYY):</b>\n<i>Masalan: 10.03.2026</i>"
    },
    "error_date": {
        "ru": "❌ Неверный формат даты!",
        "uz": "❌ Sana formati noto'g'ri!"
    }
}

beton = {
    "M100-A": 419265,
    "M150-A": 431970,
    "M200-A": 470085,
    "M250-A": 520905,
    "M300-A": 584430,
    "M350-A": 609840,
    "M400-A": 635250,
    "M450-A": 686070
}

fbs_prices = {
    "ФБС 9.4.6-Т": 97650,
    "ФБС 12.4.6-Т": 126000,
    "ФБС 24.4.6-Т": 241500
}
price_distance=1800
price_distance_limit=70
distance_from=15
price_beton=30000
price_plita_sm_12=2067
price_plita_sm_10=2756
start_price_12=214988
start_price_10=187425
def calculate_price_plita(product,distance):
    product = PLITA_PRICES.get(product)




    return product[str(distance)] * distance




    # if product == "1.2 м":
    #
    #     if distance <= 3.9:
    #         price_per_one = start_price_12
    #     else:
    #
    #         extra_sm = (distance - 3.9) * 100
    #         price_per_one = start_price_12 + (extra_sm * price_plita_sm_12)
    #
    # else:  # Для "1.0 м"
    #     # Порог 3.7 метра
    #     if distance <= 3.7:
    #         price_per_one = start_price_10
    #     else:
    #         # Считаем разницу в см: (текущая длина - 3.7) * 100
    #         extra_sm = (distance - 3.7) * 100
    #         price_per_one = start_price_10 + (extra_sm * price_plita_sm_10)
    #
    #     # Итоговая сумма за все количество
    #
    # return int(price_per_one)

CATEGORIES_CONFIG = {
    "fbs": {
        "tovar_ru": "Фундаментальные блоки",
        "tovar_uz": "Bloklar",
        "unit_ru": "шт",
        "unit_uz": "dona",
        "emoji": "🧱",
        "label_ru": "Тип блока",
        "label_uz": "Blok turi",
        "has_distance": False,
        "price_dict": fbs_prices,
    },
    "beton": {
        "tovar_ru": "Товарный бетон",
        "tovar_uz": "Tayyor beton",
        "unit_ru": "м³",
        "unit_uz": "m³",
        "emoji": "💧",
        "label_ru": "Марка",
        "label_uz": "Markasi",
        "has_distance": True,
        "price_dict": beton
    },
    "lotok": {
        "tovar_ru": "Лотки 6м",
        "tovar_uz": "Lotoklar 6m",
        "unit_ru": "шт",
        "unit_uz": "dona",
        "emoji": "〰️",
        "label_ru": "Размер лотка",
        "label_uz": "Lotok o'lchami",
        "has_distance": False,
        "price_dict": 810000  # Заменил на переменную словаря
    },
    "plita": {
        "tovar_ru": "Плиты перекрытия ПБ",
        "tovar_uz": "Qavat plitalari",
        "unit_ru": "шт",
        "unit_uz": "dona",
        "emoji": "🏗",
        "label_ru": "Маркировка плиты",
        "label_uz": "Plita markirovkasi",
        "has_distance": True, # Обычно плиты заказывают без автоматического расчета доставки за км

    }
}

